# IsValidVersionGUID Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..IsValidVersionGUID Method
Document Class See Also
---
Checks whether the GUID is valid for the given document. Empty GUID is allowed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public static bool IsValidVersionGUID(
	Document document,
	Guid versionGUID
)
```

Visual Basic
---
```text
Public Shared Function IsValidVersionGUID ( _
	document As Document, _
	versionGUID As Guid _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidVersionGUID(
	Document^ document,
	Guid versionGUID
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document Target document.
versionGUID
    Type: System..::..Guid The GUID to check.
# ### Return Value
True if the GUID is valid.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Document Class
Autodesk.Revit.DB Namespace